In [1]:
import pandas as pd

In [8]:
if __name__ == '__main__':

    # read csv file into a dataframe
    df4 = pd.read_csv('files_to_process/D4.csv', delimiter = '|')
    df5 = pd.read_csv('files_to_process/D5.csv', delimiter = '|')

    # combine 2 dataframes into 1 dataframe
    df = pd.concat([df4, df5], ignore_index = True)

    # let's see example rows
    print(df.head(4))

   Name  Age  Height
0  Nana   10     127
1  Mark   10     147
2  Chew   13     165
3  Mark   10     147

In [11]:
df

    Name  Age  Height
0   Nana   10     127
1   Mark   10     147
2   Chew   13     165
3   Mark   10     147
4  Nueng   20     176

In [9]:
# check for duplicated ectries in the 'Name' column
df.duplicated('Name')

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [10]:
df[df.duplicated('Name')]

   Name  Age  Height
3  Mark   10     147

In [13]:
# see "Min" and "Max" age

print("Min age is: ", df['Age'].min())
print("Max age is: ", df['Age'].max())

Min age is:  10
Max age is:  20